"use client";
import { useState } from "react";

interface FAQ {
  title: string;
  content: string;
}

const FAQ: React.FC = () => {
  const faqs: FAQ[] = [
    {
      title: "مدارک سفر چه زمانی برای من ارسال می‌شود؟",
      content: `پس از ثبت و نهایی کردن رزرو، لینک قرارداد برای شما ارسال شده که شامل اطلاعات هتل و پرواز شماست و پس از نهایی‌شدن رزرو شما تا ۲۴ ساعت قبل از پرواز، مدارک سفر شامل واچر هتل و بلیط پرواز برایتان ارسال می‌شود. در صورت نیاز، کارشناسان مرکز پشتیبانی با شما تماس می‌گیرند.`,
    },
    {
      title: "آیا پس از اینکه تور را رزرو کردیم، می‌توانیم تاریخ رزومان را تغییر دهیم؟",
      content: `پس از ثبت و نهایی کردن رزرو ، لینک قرارداد برای شما ارسال شده که شامل اطلاعات هتل و پرواز شماست و پس از نهایی‌شدن رزرو شما تا ۲۴ ساعت قبل از پرواز، مدارک سفر شامل واچر هتل و بلیط پرواز برایتان ارسال می‌شود. در صورت نیاز، کارشناسان مرکز پشتیبانی با شما تماس می‌گیرند.`,
    },
    {
      title: "آیا می‌توانم برای سفارش توری که داشتم درخواست فاکتور رسمی بدهم؟",
      content: `پس از ثبت و نهایی کردن رزرو ، لینک قرارداد برای شما ارسال شده که شامل اطلاعات هتل و پرواز شماست و پس از نهایی‌شدن رزرو شما تا ۲۴ ساعت قبل از پرواز، مدارک سفر شامل واچر هتل و بلیط پرواز برایتان ارسال می‌شود. در صورت نیاز، کارشناسان مرکز پشتیبانی با شما تماس می‌گیرند.`,
    },
    {
      title: "بعد از نهایی‌شدن سفارش، آیا باید در هتل هم مبلغی بپردازم؟",
      content: `پس از ثبت و نهایی کردن رزرو ، لینک قرارداد برای شما ارسال شده که شامل اطلاعات هتل و پرواز شماست و پس از نهایی‌شدن رزرو شما تا ۲۴ ساعت قبل از پرواز، مدارک سفر شامل واچر هتل و بلیط پرواز برایتان ارسال می‌شود. در صورت نیاز، کارشناسان مرکز پشتیبانی با شما تماس می‌گیرند.`,
    },
    {
      title: "هزینه بلیط هواپیما برای نوزادان و کودکان زیر 12 سال چقدر است؟",
      content: `پس از ثبت و نهایی کردن رزرو ، لینک قرارداد برای شما ارسال شده که شامل اطلاعات هتل و پرواز شماست و پس از نهایی‌شدن رزرو شما تا ۲۴ ساعت قبل از پرواز، مدارک سفر شامل واچر هتل و بلیط پرواز برایتان ارسال می‌شود. در صورت نیاز، کارشناسان مرکز پشتیبانی با شما تماس می‌گیرند.`,
    },
    {
      title: "برای اقامت در هتل‌ها باید مدارک خاصی ارائه کنم؟",
      content: `پس از ثبت و نهایی کردن رزرو ، لینک قرارداد برای شما ارسال شده که شامل اطلاعات هتل و پرواز شماست و پس از نهایی‌شدن رزرو شما تا ۲۴ ساعت قبل از پرواز، مدارک سفر شامل واچر هتل و بلیط پرواز برایتان ارسال می‌شود. در صورت نیاز، کارشناسان مرکز پشتیبانی با شما تماس می‌گیرند.`,
    },
    {
      title: "آیا می‌توانم قبل از شروع تور خارجی با لیدر ارتباط بگیرم؟",
      content: `پس از ثبت و نهایی کردن رزرو ، لینک قرارداد برای شما ارسال شده که شامل اطلاعات هتل و پرواز شماست و پس از نهایی‌شدن رزرو شما تا ۲۴ ساعت قبل از پرواز، مدارک سفر شامل واچر هتل و بلیط پرواز برایتان ارسال می‌شود. در صورت نیاز، کارشناسان مرکز پشتیبانی با شما تماس می‌گیرند.`,
    },
  ];

  const [openIndex, setOpenIndex] = useState<number | null>(null);

  return (
    <div className="container mx-auto px-4 mt-5">
      <div className="bg-white rounded-md shadow-md overflow-hidden">
        <div className="p-4">
          {faqs.map((faq, index) => (
            <div key={index} className="border-b border-dashed  border-[#99DBCF]">
              <button
                className="w-full text-left py-4 px-6 flex justify-between items-center hover:bg-gray-50 focus:outline-none"
                onClick={() => setOpenIndex(openIndex === index ? null : index)}
              >
                <span className="font-medium text-lg">{faq.title}</span>
                <img
                  src="/svg/arrowdown.svg"
                  alt="Expand"
                  className={`transition-transform ${openIndex === index ? "rotate-180" : ""} w-5 h-5`}
                />
              </button>
              {openIndex === index && (
                <div className="px-6 pb-4 text-gray-700">
                  <p>{faq.content}</p>
                </div>
              )}
            </div>
          ))}
        </div>
        <div className="mt-4 p-4">
          <img src="/image/Panel/Jungle.svg" alt="Jungle" className="w-full h-auto" />
        </div>
      </div>
    </div>
  );
};

export default FAQ;
